In [1]:
import time

In [7]:
#normal function
#addition

start = time.time()
def addition_normal(x,y):
    return x+y
addition_normal (3,5)
done = time.time()

elapsed_time_normal = done-start
print (elapsed_time_normal)

0.00018596649169921875

In [8]:
#lambda function
#addition

start2 = time.time()
addition_lambda = (lambda x,y : x+y)
print (addition_lambda(3,9))
done2 = time.time()

elapsed_time_lambda = done2-start2
print (elapsed_time_lambda)

12
0.0009119510650634766

In [9]:
#time difference
print (elapsed_time_lambda - elapsed_time_normal)

0.0007259845733642578

In [11]:
def my_function(n):
	return lambda a: a*n

my_doubler = my_function(2)
print (my_doubler(11))
print ((my_function(2))(11))

22
22

# Lambda Function on filter()

## filter() without lambda function

In [19]:
def my_filter(data):
    if data > 5:
        return True
    else :
        return False

my_data = [1,2,3,4,5,6,7,8,9,10]
filtered = filter (my_filter, my_data)
print (list(filtered))

[6, 7, 8, 9, 10]

## filter() with lambda function

In [20]:
my_data = [1,2,3,4,5,6,7,8,9,10]
filtered = filter(lambda data: data>5, my_data)
print (list(filtered))

[6, 7, 8, 9, 10]

# Lambda Function on map()

In [21]:
def my_map (data):
    return data * 2

my_data = [1,2,3,4,5,6,7,8,9,10]
mapped = map(my_map, my_data)
print (list(mapped))

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

In [24]:
my_data = [1,2,3,4,5,6,7,8,9,10]
mapped = map(lambda data: data*2, my_data)
print (list(mapped))

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

In [25]:
# Add two lists using map and lambda
  
numbers1 = [1, 2, 3]
numbers2 = [4, 5, 6]
  
result = map(lambda x, y: x + y, numbers1, numbers2)
print(list(result))

[5, 7, 9]

In [26]:
# List of strings
l = ['sat', 'bat', 'cat', 'mat']
  
# map() can listify the list of strings individually
test = list(map(list, l))
print(test)

[['s', 'a', 't'], ['b', 'a', 't'], ['c', 'a', 't'], ['m', 'a', 't']]

In [36]:
import pandas as pd

data = pd.Series (["LIA","MIA","AGUNG","AJI","Sutoyo","Limbad"])
df = pd.DataFrame(
    {"name": data,
     "score": [50, 32, 45, 45, 23, 45]
    }
)

In [37]:
df

     name  score
0     LIA     50
1     MIA     32
2   AGUNG     45
3     AJI     45
4  Sutoyo     23
5  Limbad     45

In [40]:
df["lower_name"] = df["name"].apply(lambda x: x.lower())
df

     name  score lower_name
0     LIA     50        lia
1     MIA     32        mia
2   AGUNG     45      agung
3     AJI     45        aji
4  Sutoyo     23     sutoyo
5  Limbad     45     limbad

In [42]:
l = ['sat', 'bat', 'cat', 'mat']
test = list(map(list, l))
print(test)

[['s', 'a', 't'], ['b', 'a', 't'], ['c', 'a', 't'], ['m', 'a', 't']]

In [43]:
list(1)

TypeError: 'int' object is not iterable